export default {
  装备基础属性: {
    等级: 120,
    基础攻击: 29831,
    破防等级: 29433,
    无双等级: 35634,
    会心等级: 36536,
    会心效果等级: 5353,
    全能等级: 0,
    武器伤害_最小值: 3629,
    武器伤害_最大值: 6048,
    破招值: 836,
    力道: 8757,
    元气: 41,
    身法: 41,
    根骨: 41,
    体质: 0,
    加速等级: 6850,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 98396,
      装备部位: '帽子',
      附魔: '攻击+439',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 98368,
      装备部位: '衣服',
      附魔: '无双+291',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '3',
      id: 98445,
      装备部位: '腰带',
      附魔: '无双+291',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '3',
      id: 98455,
      装备部位: '护腕',
      附魔: '力道+218',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '6',
      id: 98390,
      装备部位: '下装',
      附魔: '力道+218',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '6',
      id: 98308,
      装备部位: '鞋子',
      附魔: '加速+974',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 39818,
      装备部位: '项链',
      附魔: '体质+361',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 4,
      id: 39854,
      装备部位: '腰坠',
      附魔: '体质+361',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: '3',
      id: 39862,
      装备部位: '戒指',
      附魔: '力道+218',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: '3',
      id: 39862,
      装备部位: '戒指',
      附魔: '力道+218',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '6',
      id: 37187,
      装备部位: '暗器',
      附魔: '力道+218',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: '4',
      id: 37251,
      装备部位: '武器',
      附魔: '攻击+439',
    },
  ],
  五彩石: '彩·真刚·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 1,
    大附魔_伤衣: 1,
    大附魔_伤腰: 1,
    大附魔_伤腕: 1,
    大附魔_伤鞋: 1,
    风特效腰坠_英雄: true,
    水特效武器_英雄: true,
    套装会心会效: false,
    套装技能: 1,
    切糕会心: false,
    切糕无双: false,
    切糕会心_英雄: false,
    切糕无双_英雄: false,
    冬至套装: false,
  },
}
