import { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'
import { 按数字生成数组 } from '@/工具函数/help'
import 通用增益 from './通用增益/通用增益'
import 门派套装增益 from './通用增益/门派套装增益'
import 大橙武技能增益 from './通用增益/大橙武技能增益'
import 小橙武技能增益 from './通用增益/小橙武技能增益'

// 24599
const 快雪溅玉函数 = () => {
  const 数组 = 按数字生成数组(4)
  const 快雪溅玉增伤数 = [174, 348, 420, 696]
  return 数组.map((item) => {
    return {
      增益名称: `溅玉·${item}`,
      增益所在位置: '奇穴',
      依赖奇穴: '雪中行',
      增益类型: '部分启用',
      增益集合: [
        { 属性: 属性类型.内功会心百分比, 值: 0.06 * item },
        { 属性: 属性类型.郭氏内功基础攻击, 值: 102 * item },
        { 属性: 属性类型.通用增伤, 值: 快雪溅玉增伤数[item - 1] / 1024 },
      ],
    } as 技能增益列表类型
  })
}

const 快雪时晴增益: 技能增益列表类型[] = [
  ...通用增益.filter((item) => !item.增益名称?.includes('溅玉')),
  ...快雪溅玉函数(),
  ...门派套装增益,
  ...大橙武技能增益,
  ...小橙武技能增益,
  {
    增益名称: '雪弃',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 512 / 1024 }],
  },
  {
    增益名称: '5%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 51 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
]

export default 快雪时晴增益
