/**
 * @name 装备部位
 */
export enum 装备部位枚举 {
  帽子 = '帽子',
  衣服 = '衣服',
  腰带 = '腰带',
  护腕 = '护腕',
  下装 = '下装',
  鞋子 = '鞋子',
  项链 = '项链',
  腰坠 = '腰坠',
  戒指 = '戒指',
  暗器 = '暗器',
  武器 = '武器',
}

export enum 小吃类型枚举 {
  药品辅助 = '药品辅助',
  药品增强 = '药品增强',
  食品辅助 = '食品辅助',
  食品增强 = '食品增强',
  武器磨石 = '武器磨石',
  家园菜品 = '家园菜品',
  家园酒品 = '家园酒品',
  团队宴席 = '团队宴席',
}

export enum 五彩石增益类型枚举 {
  全属性 = '全属',
  力道 = '力道',
  身法 = '身法',
  元气 = '元气',
  根骨 = '根骨',
  外功基础攻击 = '外攻',
  内功基础攻击 = '内攻',
  破防等级 = '破防',
  会心效果等级 = '会效',
  武器伤害 = '武伤',
  加速等级 = '加速',
  会心等级 = '会心',
  无双等级 = '无双',
  破招值 = '破招',
}

// 镶嵌增伤类型
export enum 镶嵌增伤类型枚举 {
  力道 = '力道',
  身法 = '身法',
  元气 = '元气',
  根骨 = '根骨',
  外攻 = '外攻',
  内攻 = '内攻',
  破招 = '破招',
  会心 = '会心',
  会效 = '会效',
  破防 = '破防',
  无双 = '无双',
  加速 = '加速',
  气血 = '气血',
  全能 = '全能',
}
