import { 属性类型 } from '@/@types/属性'
import { 技能基础数据模型 } from '@/@types/技能'
import { 计算公式计算类型 } from '@/@types/伤害计算'
import { 获取破招实际系数 } from '@/数据/数据工具/获取技能系数'

import 通用增益 from './技能增益/通用增益/通用增益'
import 三星临增益 from './技能增益/三星临'
import 兵主逆增益 from './技能增益/兵主逆'
import 天斗旋增益 from './技能增益/天斗旋'
import 鬼星开穴增益 from './技能增益/鬼星开穴'
import 亘天增益 from './技能增益/亘天'
import 九字诀山卦通用增益 from './技能增益/通用增益/九字诀山卦通用增益'

const 非山卦三星临: Partial<技能基础数据模型> = {
  统计名称: '三星临',
  秘籍依赖技能: '三星临',
  技能伤害系数: 207,
  基础伤害_基础值: 88,
  基础伤害_浮动值: 56,
  技能增益列表: 三星临增益,
  技能等级数据: {
    '1,15': {
      技能伤害系数: (i) => 45 + i * 5,
      基础伤害_基础值: [39, 41, 43, 45, 48, 50, 52, 55, 59, 60, 66, 68, 75, 78],
      基础伤害_浮动值: [25, 27, 28, 29, 31, 33, 35, 39, 40, 43, 45, 49, 50, 52],
    },
    '15,17': {
      技能伤害系数: (i) => 45 + i * 9,
      基础伤害_基础值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 85],
      基础伤害_浮动值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 53, 54],
    },
  },
}

const 非山卦兵主逆: Partial<技能基础数据模型> = {
  统计名称: '兵主逆',
  秘籍依赖技能: '兵主逆',
  技能伤害系数: 230 * 1.1,
  基础伤害_基础值: 390,
  基础伤害_浮动值: 188,
  技能增益列表: 兵主逆增益,
  技能等级数据: {
    '1,15': {
      技能伤害系数: (i) => (40 + i * 6) * 1.1,
      基础伤害_基础值: [125, 130, 135, 140, 145, 150, 170, 190, 210, 230, 250, 270, 290, 310],
      基础伤害_浮动值: [10, 15, 17, 19, 21, 23, 25, 28, 52, 57, 65, 67, 71, 75],
    },
    '15,18': {
      技能伤害系数: (i) => (40 + i * 10) * 1.1,
      基础伤害_基础值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 330, 350, 370],
      基础伤害_浮动值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 79, 153, 174],
    },
  },
}

const 非山卦天斗旋: Partial<技能基础数据模型> = {
  统计名称: '天斗旋',
  秘籍依赖技能: '天斗旋',
  技能伤害系数: 437,
  基础伤害_基础值: 730,
  基础伤害_浮动值: 500,
  技能增益列表: 天斗旋增益,
  基础伤害_倍率: 0.85,
  技能等级数据: {
    '1,16': {
      技能伤害系数: (i) => 110 + i * 8,
      基础伤害_基础值: [270, 285, 300, 315, 330, 350, 370, 390, 410, 430, 450, 470, 500, 530, 560],
      基础伤害_浮动值: [30, 35, 45, 55, 70, 85, 100, 115, 135, 155, 175, 205, 235, 265, 295],
    },
    '16,19': {
      技能伤害系数: (i) => 160 + i * 13,
      基础伤害_基础值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 590, 650, 680],
      基础伤害_浮动值: [0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 10, 20, 20, 20, 20, 325, 400, 450],
    },
  },
}

const 鬼星开穴: Partial<技能基础数据模型> = {
  统计名称: '鬼星开穴',
  秘籍依赖技能: '鬼星开穴',
  技能伤害系数: 550.7235,
  基础伤害_基础值: 730,
  基础伤害_浮动值: 500,
  基础伤害_倍率: (1.05 * 2) / 2,
  技能增益列表: 鬼星开穴增益,
  技能等级数据: {
    '1,15': {
      技能伤害系数: (i) => (70 + i * 5) * 2 * 0.9 * 0.85 * 1.15,
      基础伤害_基础值: [285, 300, 315, 330, 350, 370, 390, 410, 430, 450, 470, 500, 530, 560],
      基础伤害_浮动值: [35, 45, 55, 70, 85, 100, 115, 135, 155, 175, 205, 235, 265, 295],
    },
    '15,19': {
      技能伤害系数: (i) => (115 + i * 11) * 2 * 0.9 * 0.85 * 1.15,
      基础伤害_基础值: { 15: 590, 16: 650, 17: 680, 18: 730 },
      基础伤害_浮动值: { 15: 325, 16: 400, 17: 450, 18: 500 },
    },
    '19,22': {
      技能伤害系数: (i) => (325 + 45 * (i - 18)) * 2 * 0.9 * 0.85 * 1.15,
      基础伤害_基础值: { 19: 730 * 1.9, 20: 730 * 1.9, 21: 730 * 1.9 },
      基础伤害_浮动值: { 19: 500 * 1.9, 20: 500 * 1.9, 21: 500 * 1.9 },
    },
  },
}

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能名称: '破', // 32886
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(1048576 * (1.4168 * 1.4 * 0.88 - 1)),
    技能增益列表: 通用增益,
    技能等级数据: {
      2: {
        技能伤害系数: 获取破招实际系数(1048576 * (1.4168 * 0.3 * 2.3 * 0.4 - 1)),
      },
    },
  },
  {
    技能名称: '魂击', // 25512
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '三星临', // 24558
    ...非山卦三星临,
  },
  {
    技能名称: '三星临·水', // 24675
    ...非山卦三星临,
  },
  {
    技能名称: '三星临·火', // 24677
    ...非山卦三星临,
  },
  {
    技能名称: '三星临·山', // 24676
    统计名称: '三星临',
    秘籍依赖技能: '三星临',
    技能伤害系数: 207 * 1.05,
    基础伤害_基础值: 88,
    基础伤害_浮动值: 56,
    基础伤害_倍率: 1.05,
    技能增益列表: [...三星临增益, ...九字诀山卦通用增益],
    技能等级数据: {
      '1,14': {
        技能伤害系数: (i) => (45 + i * 5) * 1.05,
        基础伤害_基础值: [39, 41, 43, 45, 48, 50, 52, 55, 59, 60, 66, 68, 75, 78, 82, 85, 88],
        基础伤害_浮动值: [25, 27, 28, 29, 31, 33, 35, 39, 40, 43, 45, 49, 50, 52, 53, 54, 56],
      },
      '15,16': {
        技能伤害系数: (i) => (45 + i * 9) * 1.05,
        基础伤害_基础值: [39, 41, 43, 45, 48, 50, 52, 55, 59, 60, 66, 68, 75, 78, 82, 85, 88],
        基础伤害_浮动值: [25, 27, 28, 29, 31, 33, 35, 39, 40, 43, 45, 49, 50, 52, 53, 54, 56],
      },
    },
  },
  {
    技能名称: '兵主逆', // 24811
    ...非山卦兵主逆,
  },
  {
    技能名称: '兵主逆·水', // 24812
    ...非山卦兵主逆,
  },
  {
    技能名称: '兵主逆·火', // 24814
    ...非山卦兵主逆,
  },
  {
    技能名称: '兵主逆·山', // 24813
    统计名称: '兵主逆',
    秘籍依赖技能: '兵主逆',
    技能伤害系数: 230 * 1.05 * 1.1,
    基础伤害_基础值: 390,
    基础伤害_浮动值: 188,
    基础伤害_倍率: 1.05,
    技能增益列表: [...兵主逆增益, ...九字诀山卦通用增益],
    技能等级数据: {
      '1,15': {
        技能伤害系数: (i) => (40 + i * 6) * 1.05 * 1.1,
        基础伤害_基础值: [125, 130, 135, 140, 145, 150, 170, 190, 210, 230, 250, 270, 290, 310],
        基础伤害_浮动值: [10, 15, 17, 19, 21, 23, 25, 28, 52, 57, 65, 67, 71, 75],
      },
      '15,18': {
        技能伤害系数: (i) => (40 + i * 10) * 1.05 * 1.1,
        基础伤害_基础值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 330, 350, 370],
        基础伤害_浮动值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 79, 153, 174],
      },
    },
  },
  {
    技能名称: '天斗旋', // 24821
    ...非山卦天斗旋,
  },
  {
    技能名称: '天斗旋·水', // 24822
    ...非山卦天斗旋,
  },
  {
    技能名称: '天斗旋·火', // 24824
    ...非山卦天斗旋,
  },
  {
    技能名称: '天斗旋·山', // 24823
    统计名称: '天斗旋',
    秘籍依赖技能: '天斗旋',
    技能伤害系数: 437 * 1.05,
    基础伤害_基础值: 730,
    基础伤害_浮动值: 500,
    基础伤害_倍率: 1.05 * 0.85,
    技能增益列表: [...天斗旋增益, ...九字诀山卦通用增益],
    技能等级数据: {
      '1,16': {
        技能伤害系数: (i) => (110 + i * 8) * 1.05,
        基础伤害_基础值: [
          270, 285, 300, 315, 330, 350, 370, 390, 410, 430, 450, 470, 500, 530, 560,
        ],
        基础伤害_浮动值: [30, 35, 45, 55, 70, 85, 100, 115, 135, 155, 175, 205, 235, 265, 295],
      },
      '16,19': {
        技能伤害系数: (i) => (160 + i * 13) * 1.05,
        基础伤害_基础值: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 590, 650, 680],
        基础伤害_浮动值: [0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 10, 20, 20, 20, 20, 325, 400, 450],
      },
    },
  },
  {
    技能名称: '卦象·火离', // 24454
    技能伤害系数: 200,
    基础伤害_基础值: 75,
    基础伤害_浮动值: 43,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1': {
        技能伤害系数: 30,
        基础伤害_基础值: 50,
        基础伤害_浮动值: 28,
      },
      '2,8': {
        技能伤害系数: (i) => 120 + (i - 1) * 6,
        基础伤害_基础值: [0, 52, 55, 59, 60, 66, 68],
        基础伤害_浮动值: [0, 29, 31, 33, 35, 39, 40],
      },
    },
  },
  {
    技能名称: '鬼星开穴', // 24870
    ...鬼星开穴,
  },
  {
    技能名称: '鬼星开穴·龙回首', // 37311
    ...鬼星开穴,
  },
  {
    技能名称: '列宿游', // 33236
    统计名称: '列宿游',
    基础伤害_基础值: 33,
    基础伤害_浮动值: 5,
    基础伤害_倍率: (1.05 * 2) / 2,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1,17': {
        技能伤害系数: (i) => (800 + 800 * i * 0.03) * 1.15 * 0.283,
      },
    },
  },
  {
    技能名称: '天网', // 30847
    技能伤害系数: 100,
    基础伤害_基础值: 50,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '亘天', // 34683
    秘籍依赖技能: '天斗旋',
    技能伤害系数: 270 * 1.1,
    基础伤害_倍率: (1.05 * 2) / 2,
    基础伤害_基础值: 33,
    基础伤害_浮动值: 5,
    技能增益列表: 亘天增益,
  },
  {
    技能名称: '灵器', // 25174
    技能伤害系数: 200 * 0.9 * 1.2,
    基础伤害_基础值: 33,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '阵星入舆', // 37599
    技能伤害系数: 270 * 1.1,
    基础伤害_倍率: (1.05 * 2) / 2,
    基础伤害_基础值: 33,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '三星临·神兵', // 37599
    技能伤害系数: 50,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斗循天转(DOT)·一', // 24846
    统计名称: '斗循天转(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 10,
    技能伤害系数: 230 * 1.9,
    基础伤害_基础值: 15,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斗循天转(DOT)·二', // 24846
    统计名称: '斗循天转(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 10,
    技能伤害系数: 230 * 1.9,
    基础伤害_基础值: 15,
    伤害计算次数: 2,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斗循天转(DOT)·三', // 24846
    统计名称: '斗循天转(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 10,
    技能伤害系数: 230 * 1.9,
    基础伤害_基础值: 15,
    伤害计算次数: 3,
    技能增益列表: 通用增益,
  },
  // --------------
  {
    技能名称: '逐云寒蕊',
    技能伤害系数: 200 * 1.2,
    基础伤害_基础值: 40,
    基础伤害_浮动值: 17,
    伤害计算次数: 1,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '飘黄',
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益启用: true,
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
    ],
  },
  {
    // 伤腕
    技能名称: '昆吾·弦刃',
    真实伤害: 145300, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
    伤害计算类型标记: [计算公式计算类型.真实伤害, 计算公式计算类型.等级减伤, 计算公式计算类型.易伤],
  },
  {
    // 伤鞋
    技能名称: '刃凌',
    真实伤害: 96900, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
    伤害计算类型标记: [计算公式计算类型.真实伤害, 计算公式计算类型.等级减伤, 计算公式计算类型.易伤],
  },
  {
    // 龙门武器
    技能名称: '剑风',
    基础伤害_基础值: 3950,
    技能增益列表: 通用增益,
  },
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
  三星临增益,
  兵主逆增益,
  天斗旋增益,
  鬼星开穴增益,
  亘天增益,
}

export { 技能增益 }
