import { 团队增益数据类型 } from '@/@types/团队增益'
import { 属性类型 } from '@/@types/属性'
import 通用团队增益数据 from '../通用'

const 内功团队增益数据: 团队增益数据类型[] = [
  {
    增益名称: '立地成佛',
    层数: 5,
    覆盖率: 100,
    增益图片: 'https://icon.jx3box.com/icon/420.png',
    增益描述: '每层内功防御等级降低【3%】，最多叠加五层',
    增益来源: '洗髓经',
    团队增益类型: '目标减益',
    增益集合: [{ 属性: 属性类型.郭氏内功基础防御, 值: -30 }],
  },
  {
    增益名称: '破苍穹',
    层数: 1,
    覆盖率: 50,
    覆盖率支持手动录入: true,
    增益图片: 'https://icon.jx3box.com/icon/1449.png',
    增益描述: '内功会心效果提高【10%】',
    增益来源: '紫霞功',
    团队增益类型: '稀缺增益',
    增益集合: [{ 属性: 属性类型.郭氏内功会心效果等级, 值: 102 }],
  },
  ...通用团队增益数据,
]

export default 内功团队增益数据
