export default {
  装备基础属性: {
    等级: 120,
    基础攻击: 38310,
    破防等级: 35623,
    无双等级: 32322,
    会心等级: 28937,
    会心效果等级: 6702,
    全能等级: 0,
    武器伤害_最小值: 2419,
    武器伤害_最大值: 4032,
    破招值: 10672,
    力道: 41,
    元气: 41,
    身法: 41,
    根骨: 7254,
    体质: 0,
    加速等级: 974,
  },
  装备列表: [
    {
      当前精炼等级: 6,
      装备部位: '帽子',
      附魔: '攻击+524',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98336,
    },
    {
      当前精炼等级: 6,
      装备部位: '衣服',
      附魔: '无双+291',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98366,
    },
    {
      当前精炼等级: 6,
      装备部位: '腰带',
      附魔: '无双+291',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98276,
    },
    {
      当前精炼等级: 3,
      装备部位: '护腕',
      附魔: '破防+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98456,
    },
    {
      当前精炼等级: 3,
      装备部位: '下装',
      附魔: '破防+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98464,
    },
    {
      当前精炼等级: 6,
      装备部位: '鞋子',
      附魔: '攻击+524',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98306,
    },
    {
      当前精炼等级: 6,
      装备部位: '项链',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 39816,
    },
    {
      当前精炼等级: 4,
      装备部位: '腰坠',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 39852,
    },
    {
      当前精炼等级: 3,
      装备部位: '戒指',
      附魔: '攻击+524',
      镶嵌孔数组: [],
      id: 39860,
    },
    {
      当前精炼等级: 3,
      装备部位: '戒指',
      附魔: '攻击+524',
      镶嵌孔数组: [],
      id: 39860,
    },
    {
      当前精炼等级: 6,
      装备部位: '暗器',
      附魔: '加速+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      id: 37185,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 4,
      id: 37249,
      装备部位: '武器',
      附魔: '攻击+524',
    },
  ],
  五彩石: '彩·星见·灭气·月华(陆)',
  装备增益: {
    大附魔_伤帽: 1,
    大附魔_伤衣: 1,
    大附魔_伤腰: 1,
    大附魔_伤腕: 1,
    大附魔_伤鞋: 1,
    风特效腰坠_英雄: true,
    水特效武器_英雄: true,
    套装会心会效: true,
    套装技能: 1,
    切糕会心: false,
    切糕无双: false,
    切糕会心_英雄: false,
    切糕无双_英雄: false,
    冬至套装: false,
  },
}
